gt/lectureplan2016.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-09-28 Wed 10:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Lecture Plan "Game Theory" 2016</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Christoph Schottmueller" />
</head>
<body>
<div id="content">
<h1 class="title">Lecture Plan "Game Theory" 2016</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline5">Lecture 1: Intro expected utility theorem</a></li>
<li><a href="#orgheadline9">Lecture 2: NE</a></li>
<li><a href="#orgheadline13">Lecture 3: Rationalizability and dominance</a></li>
<li><a href="#orgheadline16">Lecture 4: Correlated equilibrium</a></li>
<li><a href="#orgheadline19">Lecture 5: Refinements I</a></li>
<li><a href="#orgheadline24">Lecture 6: Refinements II</a></li>
<li><a href="#orgheadline26">Lecture 7: Supermodular games</a></li>
<li><a href="#orgheadline30">Lecture 8: Knowledge I</a></li>
<li><a href="#orgheadline35">Lecture 9: Knowledge II</a></li>
<li><a href="#orgheadline37">Lecture 10: Midterm Assignment</a></li>
<li><a href="#orgheadline39">Lecture 11: Global Games</a></li>
<li><a href="#orgheadline40">Lecture 12: Disclosure games</a></li>
<li><a href="#orgheadline45">Lecture 13: Social Choice</a></li>
<li><a href="#orgheadline46">Bibliography</a></li>
</ul>
</div>
</div>



<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">Lecture 1: Intro expected utility theorem</h2>
<div class="outline-text-2" id="text-orgheadline5">
</div><ul class="org-ul"><li><a id="orgheadline1"></a>Introduction<br  /></li>
<li><a id="orgheadline2"></a>What is GT?<br  /></li>
<li><a id="orgheadline3"></a>expected utility theorem<br  /></li>
<li><a id="orgheadline4"></a>reading:  MSZ 2.1-2.5 or MWG 6.A-6.B, (supplementary reading: Gilboa et al.  (2014))<br  /></li></ul>
</div>
<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9">Lecture 2: NE</h2>
<div class="outline-text-2" id="text-orgheadline9">
</div><ul class="org-ul"><li><a id="orgheadline6"></a>Fixed point theorems<br  /></li>
<li><a id="orgheadline7"></a>Nash existence theorem<br  /></li>
<li><a id="orgheadline8"></a>reading: MSZ 5.3, (supplementary reading: OR 2.4; a proof of Brouwer's fixed point theorem can be found in MSZ 23.1 but reading this proof is by no means necessary)<br  /></li></ul>
</div>
<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13">Lecture 3: Rationalizability and dominance</h2>
<div class="outline-text-2" id="text-orgheadline13">
</div><ul class="org-ul"><li><a id="orgheadline10"></a>Rationalizability and iterated elimination of dominated strategies<br  /></li>
<li><a id="orgheadline11"></a>(Global game example)<br  /></li>
<li><a id="orgheadline12"></a>reading: OR 4 or MSZ 4.5, 4.7, 4.11,<br  /></li></ul>
</div>
<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16">Lecture 4: Correlated equilibrium</h2>
<div class="outline-text-2" id="text-orgheadline16">
</div><ul class="org-ul"><li><a id="orgheadline14"></a>Correlated equilibrium<br  /></li>
<li><a id="orgheadline15"></a>reading: OR 3.3 or MSZ 8<br  /></li></ul>
</div>
<div id="outline-container-orgheadline19" class="outline-2">
<h2 id="orgheadline19">Lecture 5: Refinements I</h2>
<div class="outline-text-2" id="text-orgheadline19">
</div><ul class="org-ul"><li><a id="orgheadline17"></a>perfect equilibrium in strategic form games<br  /></li>
<li><a id="orgheadline18"></a>reading: lecture notes by Hans Keiding, (MSZ 7.3.1)<br  /></li></ul>
</div>
<div id="outline-container-orgheadline24" class="outline-2">
<h2 id="orgheadline24">Lecture 6: Refinements II</h2>
<div class="outline-text-2" id="text-orgheadline24">
</div><ul class="org-ul"><li><a id="orgheadline20"></a>Extensive form games<br  /></li>
<li><a id="orgheadline21"></a>Behavior strategies<br  /></li>
<li><a id="orgheadline22"></a>Perfect equilibrium<br  /></li>
<li><a id="orgheadline23"></a>reading: MSZ 7.3.2 or OR 12.5.2; (OR 11.1 and 11.4)<br  /></li></ul>
</div>

<div id="outline-container-orgheadline26" class="outline-2">
<h2 id="orgheadline26">Lecture 7: Supermodular games</h2>
<div class="outline-text-2" id="text-orgheadline26">
</div><ul class="org-ul"><li><a id="orgheadline25"></a>Amir paper, Milgrom and Roberts paper<br  /></li></ul>
</div>
<div id="outline-container-orgheadline30" class="outline-2">
<h2 id="orgheadline30">Lecture 8: Knowledge I</h2>
<div class="outline-text-2" id="text-orgheadline30">
</div><ul class="org-ul"><li><a id="orgheadline27"></a>Hat game<br  /></li>
<li><a id="orgheadline28"></a>Aumann model<br  /></li>
<li><a id="orgheadline29"></a>reading: OR 5.1-5.2 or MSZ 9.1<br  /></li></ul>
</div>
<div id="outline-container-orgheadline35" class="outline-2">
<h2 id="orgheadline35">Lecture 9: Knowledge II</h2>
<div class="outline-text-2" id="text-orgheadline35">
</div><ul class="org-ul"><li><a id="orgheadline31"></a>No agree to disagree<br  /></li>
<li><a id="orgheadline32"></a>(Common) knowledge and solution concepts<br  /></li>
<li><a id="orgheadline33"></a>Electronic mail game<br  /></li>
<li><a id="orgheadline34"></a>reading: OR 5.3-5.5 or MSZ 9.2<br  /></li></ul>
</div>
<div id="outline-container-orgheadline37" class="outline-2">
<h2 id="orgheadline37">Lecture 10: Midterm Assignment</h2>
<div class="outline-text-2" id="text-orgheadline37">
</div><ul class="org-ul"><li><a id="orgheadline36"></a>discussing solutions to midterm assignment<br  /></li></ul>
</div>

<div id="outline-container-orgheadline39" class="outline-2">
<h2 id="orgheadline39">Lecture 11: Global Games</h2>
<div class="outline-text-2" id="text-orgheadline39">
</div><ul class="org-ul"><li><a id="orgheadline38"></a>Carlson and van Damme (p. 989-993)<br  /></li></ul>
</div>
<div id="outline-container-orgheadline40" class="outline-2">
<h2 id="orgheadline40">Lecture 12: Disclosure games</h2>
</div>

<div id="outline-container-orgheadline45" class="outline-2">
<h2 id="orgheadline45">Lecture 13: Social Choice</h2>
<div class="outline-text-2" id="text-orgheadline45">
</div><ul class="org-ul"><li><a id="orgheadline41"></a>Social welfare functions<br  /></li>
<li><a id="orgheadline42"></a>Social choice functions<br  /></li>
<li><a id="orgheadline43"></a>Arrow's impossibility theorem<br  /></li>
<li><a id="orgheadline44"></a>reading: MSZ 21.1, 21.2<br  /></li></ul>
</div>

<div id="outline-container-orgheadline46" class="outline-2">
<h2 id="orgheadline46">Bibliography</h2>
<div class="outline-text-2" id="text-orgheadline46">
<p>
OR: Osborne and Rubinstein 1994; A course in game theory; MIT Press (available as free ebook on the author's <a href="http://books.osborne.economics.utoronto.ca/">website</a>)
</p>

<p>
MSZ: Maschler, Salon and Zamir 2013; Game theory; Cambridge University Press (KU library <a href="http://dx.doi.org.ep.fjernadgang.kb.dk/10.1017/CBO9780511794216">link</a>)
</p>

<p>
MWG: MasColell, Whinston and Green 1995; Microeconomic theory; Oxford University Press
</p>

<p>
FT: Fudenberg and Tirole 1991; Game theory; MIT Press
</p>

<p>
Aumann 1985: What is game theory trying to accomplish?; Frontiers of Economics; <a href="http://www.ma.huji.ac.il/~raumann/pdf/what%20is%20game%20theory.pdf">link</a>
</p>

<p>
Gilboa, Itzhak, et al. "Economic models as analogies." The Economic Journal 124.578 (2014): pp.513-533. <a href="http://onlinelibrary.wiley.com/doi/10.1111/ecoj.12128/full">link</a>
</p>

<p>
Jann, Ole, and Christoph Schottmüller. "Correlated equilibria in homogeneous good Bertrand competition." Journal of Mathematical Economics 57 (2015): 31-37. <a href="http://dx.doi.org/10.1016/j.jmateco.2015.01.005">link</a>
</p>

<p>
Carlson and van Damme "Global Games and Equilibrium Selection", Econometrica, Vol. 61, No. 5 (Sep., 1993), pp. 989-1018;  <a href="http://www.jstor.org.ep.fjernadgang.kb.dk/stable/2951491">link</a>
</p>

<p>
Morris and Shin "Global Games: Theory and Applications", Econometric Society Monographs 35, 2003, 56-114 - Cambridge University Press; <a href="https://www.princeton.edu/~smorris/pdfs/paper_36_Global_Games.pdf">link</a>
</p>

<p>
Morris, Stephen, and Hyun Song Shin. "Unique equilibrium in a model of self-fulfilling currency attacks." American Economic Review, Vol. 88, No. 3 (1998): 587-597. <a href="http://www.jstor.org/stable/116850%20">link</a>
</p>

<p>
Amir, Rabah. "Supermodularity and complementarity in economics: an elementary survey", Southern Economic Journal, Vol. 71, No. 3 (2005): 636-660. <a href="http://www.jstor.org/stable/20062066%20">link</a>
</p>

<p>
Milgrom and Roberts “Rationalizability, Learning, and Equilibrium in Games with Strategic Complementarities”, Econometrica, Vol. 58, No. 6. (Nov., 1990), pp. 1255-1277; <a href="http://www.jstor.org.ep.fjernadgang.kb.dk/stable/2938316">link</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
 <p>author: Christoph Schottmueller <br> license: Creative Commons Attribution ShareAlike 4.0</p>
</div>
</body>
</html>
